drone-os/drone-tisl-map/svd_files/CC2538.xml
        <register>
          <name>TBPV</name>
          <description>GPTM Timer B prescale value For the 32-bit wide GPTM, this register shows the current free-running value of the Timer B prescaler in the 32-bit modes. Software can use this value in conjunction with the TBV register to determine the time elapsed between an interrupt and the ISR entry. This register is ununsed in 16- or 32-bit GPTM mode.</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PSV</name>
              <description>GPTM Timer B prescaler value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>GPTM peripheral properties The PP register provides information regarding the properties of the general-purpose Timer module.</description>
          <addressOffset>0xfc0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALTCLK</name>
              <description>Alternate clock source 0: Timer is not capable of using an alternate clock. 1: Timer is capable of using an alternate clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCNT</name>
              <description>Synchronized start 0: Timer is not capable of synchronizing the count value with other timers. 1: Timer is capable of synchronizing the count value with other timers.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHAIN</name>
              <description>Chain with other timers 0: Timer is not capable of chaining with previously numbered Timers. 1: Timer is capable of chaining with previously numbered timers.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>Timer size 0: Timer A and Timer B are 16 bits wide with 8-bit prescale. 1: Timer A and Timer B are 32 bits wide with 16-bit prescale.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RFCORE_FFSM</name>
      <description>no description available</description>
      <groupName>RFCORE_FFSM</groupName>
      <baseAddress>0x40088500</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SRCRESMASK0</name>
          <description>Source address matching result This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRCRESMASK0</name>
              <description>Extended address matching When there is a match on entry ext_n, bits 2n and 2n + 1 are set in SRCRESMASK.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCRESMASK1</name>
          <description>Source address matching result This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRCRESMASK1</name>
              <description>Short address matching When there is a match on entry panid_n + short_n, bit n is set in SRCRESMASK.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCRESMASK2</name>
          <description>Source address matching result This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRCRESMASK2</name>
              <description>24-bit mask that indicates source address match for each individual entry in the source address table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCRESINDEX</name>
          <description>Source address matching result This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRCRESINDEX</name>
              <description>The bit index of the least-significant entry (0-23 for short addresses or 0-11 for extended addresses) in SRCRESMASK, or 0x3F when there is no source match On a match, bit 5 is 0 when the match is on a short address and 1 when it is on an extended address. On a match, bit 6 is 1 when the conditions for automatic pending bit in acknowledgment have been met (see the description of SRCMATCH.AUTOPEND). The bit does not indicate if the acknowledgment is actually transmitted, and does not consider the PENDING_OR register bit and the SACK/SACKPEND/SNACK strobes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCEXTPENDEN0</name>
          <description>Source address matching control This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRCEXTPENDEN0</name>
              <description>8 LSBs of the 24-bit mask that enables or disables automatic pending for each of the 12 extended addresses. Entry n is mapped to SRCEXTPENDEN[2n]. All SRCEXTPENDEN[2n + 1] bits are don't care.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCEXTPENDEN1</name>
          <description>Source address matching control This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRCEXTPENDEN1</name>
              <description>8 middle bits of the 24-bit mask that enables or disables automatic pending for each of the 12 extended addresses Entry n is mapped to SRCEXTPENDEN[2n]. All SRCEXTPENDEN[2n + 1] bits are don't care.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCEXTPENDEN2</name>
          <description>Source address matching control This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRCEXTPENDEN2</name>
              <description>8 MSBs of the 24-bit mask that enables or disables automatic pending for each of the 12 extended addresses Entry n is mapped to SRCEXTPENDEN[2n]. All SRCEXTPENDEN[2n + 1] bits are don't care.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCSHORTPENDEN0</name>
          <description>Source address matching control This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRCSHORTPENDEN0</name>
              <description>8 LSBs of the 24-bit mask that enables or disables automatic pending for each of the 24 short addresses</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCSHORTPENDEN1</name>
          <description>Source address matching control This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRCSHORTPENDEN1</name>
              <description>8 middle bits of the 24-bit mask that enables or disables automatic pending for each of the 24 short addresses</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCSHORTPENDEN2</name>
          <description>Source address matching control This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRCSHORTPENDEN2</name>
              <description>8 MSBs of the 24-bit mask that enables or disables automatic pending for each of the 24 short addresses</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_ADDR0</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EXT_ADDR0</name>
              <description>EXT_ADDR[7:0] The IEEE extended address used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_ADDR1</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EXT_ADDR1</name>
              <description>EXT_ADDR[15:8] The IEEE extended address used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_ADDR2</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EXT_ADDR2</name>
              <description>EXT_ADDR[23:16] The IEEE extended address used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_ADDR3</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EXT_ADDR3</name>
              <description>EXT_ADDR[31:24] The IEEE extended address used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_ADDR4</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EXT_ADDR4</name>
              <description>EXT_ADDR[39:32] The IEEE extended address used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_ADDR5</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EXT_ADDR5</name>
              <description>EXT_ADDR[47:40] The IEEE extended address used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_ADDR6</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EXT_ADDR6</name>
              <description>EXT_ADDR[55:48] The IEEE extended address used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_ADDR7</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EXT_ADDR7</name>
              <description>EXT_ADDR[63:56] The IEEE extended address used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAN_ID0</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PAN_ID0</name>
              <description>PAN_ID[7:0] The PAN ID used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAN_ID1</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PAN_ID1</name>
              <description>PAN_ID[15:8] The PAN ID used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHORT_ADDR0</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SHORT_ADDR0</name>
              <description>SHORT_ADDR[7:0] The short address used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHORT_ADDR1</name>
          <description>Local address information This register is stored in RAM; the reset value is undefined.</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SHORT_ADDR1</name>
              <description>SHORT_ADDR[15:8] The short address used during destination address filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
