drone-os/drone-tisl-map/svd_files/CC2538.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SYS_CTRL</name>
      <description>no description available</description>
      <groupName>SYS_CTRL</groupName>
      <baseAddress>0x400D2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RF_TXRX</name>
        <description>RF TX/RX (Alternate) global interrupt</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>RF_ERROR</name>
        <description>RF Error (Alternate) global interrupt</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>SYS_CTRL</name>
        <description>System Control global interrupt</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>SM_TIMER</name>
        <description>SM Timer (Alternate) global interrupt</description>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_53</name>
        <description>Reserved global interrupt</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_55</name>
        <description>Reserved global interrupt</description>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_59</name>
        <description>Reserved global interrupt</description>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_60</name>
        <description>Reserved global interrupt</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_61</name>
        <description>Reserved global interrupt</description>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_64</name>
        <description>Reserved global interrupt</description>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_65</name>
        <description>Reserved global interrupt</description>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_66</name>
        <description>Reserved global interrupt</description>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_67</name>
        <description>Reserved global interrupt</description>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_68</name>
        <description>Reserved global interrupt</description>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_69</name>
        <description>Reserved global interrupt</description>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_70</name>
        <description>Reserved global interrupt</description>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_71</name>
        <description>Reserved global interrupt</description>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_72</name>
        <description>Reserved global interrupt</description>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_73</name>
        <description>Reserved global interrupt</description>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_74</name>
        <description>Reserved global interrupt</description>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_75</name>
        <description>Reserved global interrupt</description>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_76</name>
        <description>Reserved global interrupt</description>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_77</name>
        <description>Reserved global interrupt</description>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_78</name>
        <description>Reserved global interrupt</description>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_79</name>
        <description>Reserved global interrupt</description>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_80</name>
        <description>Reserved global interrupt</description>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_81</name>
        <description>Reserved global interrupt</description>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_82</name>
        <description>Reserved global interrupt</description>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_83</name>
        <description>Reserved global interrupt</description>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_84</name>
        <description>Reserved global interrupt</description>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_85</name>
        <description>Reserved global interrupt</description>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_86</name>
        <description>Reserved global interrupt</description>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_87</name>
        <description>Reserved global interrupt</description>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_88</name>
        <description>Reserved global interrupt</description>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_89</name>
        <description>Reserved global interrupt</description>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_90</name>
        <description>Reserved global interrupt</description>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_91</name>
        <description>Reserved global interrupt</description>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_92</name>
        <description>Reserved global interrupt</description>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_93</name>
        <description>Reserved global interrupt</description>
        <value>93</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_94</name>
        <description>Reserved global interrupt</description>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_95</name>
        <description>Reserved global interrupt</description>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_96</name>
        <description>Reserved global interrupt</description>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_97</name>
        <description>Reserved global interrupt</description>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_98</name>
        <description>Reserved global interrupt</description>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_99</name>
        <description>Reserved global interrupt</description>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_100</name>
        <description>Reserved global interrupt</description>
        <value>100</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_101</name>
        <description>Reserved global interrupt</description>
        <value>101</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_102</name>
        <description>Reserved global interrupt</description>
        <value>102</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_103</name>
        <description>Reserved global interrupt</description>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_104</name>
        <description>Reserved global interrupt</description>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_105</name>
        <description>Reserved global interrupt</description>
        <value>105</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_106</name>
        <description>Reserved global interrupt</description>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_107</name>
        <description>Reserved global interrupt</description>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_108</name>
        <description>Reserved global interrupt</description>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_109</name>
        <description>Reserved global interrupt</description>
        <value>109</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_110</name>
        <description>Reserved global interrupt</description>
        <value>110</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_111</name>
        <description>Reserved global interrupt</description>
        <value>111</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_112</name>
        <description>Reserved global interrupt</description>
        <value>112</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_113</name>
        <description>Reserved global interrupt</description>
        <value>113</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_114</name>
        <description>Reserved global interrupt</description>
        <value>114</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_115</name>
        <description>Reserved global interrupt</description>
        <value>115</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_116</name>
        <description>Reserved global interrupt</description>
        <value>116</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_117</name>
        <description>Reserved global interrupt</description>
        <value>117</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_118</name>
        <description>Reserved global interrupt</description>
        <value>118</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_119</name>
        <description>Reserved global interrupt</description>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_120</name>
        <description>Reserved global interrupt</description>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_121</name>
        <description>Reserved global interrupt</description>
        <value>121</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_122</name>
        <description>Reserved global interrupt</description>
        <value>122</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_123</name>
        <description>Reserved global interrupt</description>
        <value>123</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_124</name>
        <description>Reserved global interrupt</description>
        <value>124</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_125</name>
        <description>Reserved global interrupt</description>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_126</name>
        <description>Reserved global interrupt</description>
        <value>126</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_127</name>
        <description>Reserved global interrupt</description>
        <value>127</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_128</name>
        <description>Reserved global interrupt</description>
        <value>128</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_129</name>
        <description>Reserved global interrupt</description>
        <value>129</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_130</name>
        <description>Reserved global interrupt</description>
        <value>130</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_131</name>
        <description>Reserved global interrupt</description>
        <value>131</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_132</name>
        <description>Reserved global interrupt</description>
        <value>132</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_133</name>
        <description>Reserved global interrupt</description>
        <value>133</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_134</name>
        <description>Reserved global interrupt</description>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_135</name>
        <description>Reserved global interrupt</description>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_136</name>
        <description>Reserved global interrupt</description>
        <value>136</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_137</name>
        <description>Reserved global interrupt</description>
        <value>137</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_138</name>
        <description>Reserved global interrupt</description>
        <value>138</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_139</name>
        <description>Reserved global interrupt</description>
        <value>139</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_140</name>
        <description>Reserved global interrupt</description>
        <value>140</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_141</name>
        <description>Reserved global interrupt</description>
        <value>141</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_142</name>
        <description>Reserved global interrupt</description>
        <value>142</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_143</name>
        <description>Reserved global interrupt</description>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_144</name>
        <description>Reserved global interrupt</description>
        <value>144</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_145</name>
        <description>Reserved global interrupt</description>
        <value>145</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_146</name>
        <description>Reserved global interrupt</description>
        <value>146</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_147</name>
        <description>Reserved global interrupt</description>
        <value>147</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_148</name>
        <description>Reserved global interrupt</description>
        <value>148</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_149</name>
        <description>Reserved global interrupt</description>
        <value>149</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_150</name>
        <description>Reserved global interrupt</description>
        <value>150</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_151</name>
        <description>Reserved global interrupt</description>
        <value>151</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_152</name>
        <description>Reserved global interrupt</description>
        <value>152</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_153</name>
        <description>Reserved global interrupt</description>
        <value>153</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_154</name>
        <description>Reserved global interrupt</description>
        <value>154</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_155</name>
        <description>Reserved global interrupt</description>
        <value>155</value>
      </interrupt>
      <interrupt>
        <name>RESERVED_163</name>
        <description>Reserved global interrupt</description>
        <value>163</value>
      </interrupt>
      <registers>
        <register>
          <name>CLOCK_CTRL</name>
          <description>The clock control register handels clock settings in the CC2538. The settings in CLOCK_CTRL do not always reflect the current chip status which is found in CLOCK_STA register. </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OSC32K_CALDIS</name>
              <description>Disable calibration 32-kHz RC oscillator. 0: Enable calibration 1: Disable calibration</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC32K</name>
              <description>32-kHz clock oscillator selection 0: 32-kHz crystal oscillator 1: 32-kHz RC oscillator</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_DET</name>
              <description>Amplitude detector of XOSC during power up 0: No action 1: Delay qualification of XOSC until amplitude is greater than the threshold.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC_PD</name>
              <description>0: Power up both oscillators  1: Power down oscillator not selected by OSC bit (hardware-controlled when selected).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC</name>
              <description>System clock oscillator selection 0: 32-MHz crystal oscillator 1: 16-MHz HF-RC oscillator</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IO_DIV</name>
              <description>I/O clock rate setting Cannot be higher than OSC setting 000: 32 MHz 001: 16 MHz 010: 8 MHz 011: 4 MHz 100: 2 MHz 101: 1 MHz 110: 0.5 MHz 111: 0.25 MHz</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_DIV</name>
              <description>System clock rate setting Cannot be higher than OSC setting 000: 32 MHz 001: 16 MHz 010: 8 MHz 011: 4 MHz 100: 2 MHz 101: 1 MHz 110: 0.5 MHz 111: 0.25 MHz</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
