drone-os/drone-tisl-map/svd_files/CC2538.xml
        <register>
          <name>IRQ_DETECT_ACK</name>
          <description>If the IRQ detect ACK register is read, the value returned can be used to determine which enabled I/O port is responsible for creating a power-up interrupt to the system. Writing the IRQ detect ACK register is used to clear any number of individual port bits that may be signaling that an edge was detected as configured by the port edge control register and the interrupt control register. There is a self-clearing function to this register that generates a reset pulse to clear any interrupt which has its corresponding bit set to 1. </description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PDIACK7</name>
              <description>Port D bit 7 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK6</name>
              <description>Port D bit 6 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK5</name>
              <description>Port D bit 5 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK4</name>
              <description>Port D bit 4 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK3</name>
              <description>Port D bit 3 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK2</name>
              <description>Port D bit 2 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK1</name>
              <description>Port D bit 1 masked interrupt status: 1: Detected0: Not detected</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK0</name>
              <description>Port D bit 0 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK7</name>
              <description>Port C bit 7 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK6</name>
              <description>Port C bit 6 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK5</name>
              <description>Port C bit 5 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK4</name>
              <description>Port C bit 4 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK3</name>
              <description>Port C bit 3 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK2</name>
              <description>Port C bit 2 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK1</name>
              <description>Port C bit 1 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK0</name>
              <description>Port C bit 0 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK7</name>
              <description>Port B bit 7 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK6</name>
              <description>Port B bit 6 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK5</name>
              <description>Port B bit 5 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK4</name>
              <description>Port B bit 4 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK3</name>
              <description>Port B bit 3 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK2</name>
              <description>Port B bit 2 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK1</name>
              <description>Port B bit 1 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK0</name>
              <description>Port B bit 0 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK7</name>
              <description>Port A bit 7 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK6</name>
              <description>Port A bit 6 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK5</name>
              <description>Port A bit 5 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK4</name>
              <description>Port A bit 4 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK3</name>
              <description>Port A bit 3 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK2</name>
              <description>Port A bit 2 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK1</name>
              <description>Port A bit 1 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK0</name>
              <description>Port A bit 0 masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_IRQ_ACK</name>
          <description>Same functionality as IRQ_DETECT_ACK, but for USB</description>
          <addressOffset>0x71c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBACK</name>
              <description>USB masked interrupt status: 1: Detected 0: Not detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_DETECT_UNMASK</name>
          <description>Same functionality as IRQ_DETECT_ACK, but this register handles masked interrupts</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PDIACK7</name>
              <description>Port D bit 7 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK6</name>
              <description>Port D bit 6 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK5</name>
              <description>Port D bit 5 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK4</name>
              <description>Port D bit 4 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK3</name>
              <description>Port D bit 3 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK2</name>
              <description>Port D bit 2 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK1</name>
              <description>Port D bit 1 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIACK0</name>
              <description>Port D bit 0 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK7</name>
              <description>Port C bit 7 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK6</name>
              <description>Port C bit 6 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK5</name>
              <description>Port C bit 5 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK4</name>
              <description>Port C bit 4 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK3</name>
              <description>Port C bit 3 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK2</name>
              <description>Port C bit 2 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK1</name>
              <description>Port C bit 1 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIACK0</name>
              <description>Port C bit 0 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK7</name>
              <description>Port B bit 7 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK6</name>
              <description>Port B bit 6 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK5</name>
              <description>Port B bit 5 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK4</name>
              <description>Port B bit 4 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK3</name>
              <description>Port B bit 3 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK2</name>
              <description>Port B bit 2 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK1</name>
              <description>Port B bit 1 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIACK0</name>
              <description>Port B bit 0 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK7</name>
              <description>Port A bit 7 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK6</name>
              <description>Port A bit 6 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK5</name>
              <description>Port A bit 5 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK4</name>
              <description>Port A bit 4 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK3</name>
              <description>Port A bit 3 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK2</name>
              <description>Port A bit 2 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK1</name>
              <description>Port A bit 1 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIACK0</name>
              <description>Port A bit 0 unmasked interrupt status: 1: Detected 0: Undetected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
